Repository: Georgeamir1/Georgeamir1.github.io
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: George Amir Portfolio
ar: بورتفوليو جورج أمير

source: Home
ar: الرئيسية

source: About
ar: عنّي

source: Skills
ar: المهارات

source: Experience
ar: الخبرات

source: Projects
ar: المشاريع

source: Contact
ar: تواصل

source: Education
ar: التعليم

source: Profile
ar: الملف الشخصي

source: Languages
ar: اللغات

source: Download CV
ar: تحميل السيرة الذاتية

source: Light Theme
ar: الوضع الفاتح

source: Dark Theme
ar: الوضع الداكن

# university
source: Zagazig University
ar: جامعة الزقازيق

# bachelor
source: Bachelor in computer science
ar: بكالوريوس في علوم الحاسب

# profileDescription
source: Highly versatile software engineer with a bachelor's degree in computer science. Expertise in Flutter development and UI/UX design. Skill set includes creating user-friendly applications, collaborating effectively in remote teams, and tackling complex problems. Proficient in Flutter, Python, C++, and Photoshop. Strong communication, teamwork, and time management abilities. Bilingual in English and Arabic for effective communication and timely project delivery.
ar: مهندس برمجيات متعدد المهارات حاصل على بكالوريوس في علوم الحاسب. خبرة في تطوير تطبيقات Flutter وتصميم واجهات المستخدم UI/UX. تشمل المهارات إنشاء تطبيقات سهلة الاستخدام، والعمل الجماعي عن بُعد، وحل المشكلات المعقدة. متمكن في Flutter وPython وC++ وPhotoshop. يمتلك مهارات تواصل وعمل جماعي وإدارة وقت قوية. يتقن الإنجليزية والعربية للتواصل الفعال وتسليم المشاريع في الوقت المناسب.

source: ISC
ar: آي إس سي

source: Flutter Developer
ar: مطور Flutter

source: EgCoco
ar: إيج كوكو

# flutterDevUiUx
source: Flutter developer and UI/UX
ar: مطور Flutter وتصميم UI/UX

# skillsFlutter
source: Flutter Framework
ar: إطار عمل Flutter

# skillsDart
source: Dart Object-Oriented Programming
ar: برمجة كائنية التوجه بدارت

# skillsBloc
source: BLoC State Management
ar: إدارة الحالة BLoC

# skillsResponsive
source: Responsive UI
ar: واجهات متجاوبة

# skillsApi
source: Networking & API Integration With Dio
ar: تكامل الشبكات وواجهات البرمجة مع Dio

# skillsDebug
source: Debugging & Error Handling
ar: تصحيح الأخطاء ومعالجتها

# skillsUiUx
source: UI/UX Design: Figma | Photoshop
ar: تصميم UI/UX: Figma | Photoshop

# skillsKnowledge
source: Knowledge: IoT | Video Editing | Hardware Components | C++ | Python | Java
ar: معرفة: إنترنت الأشياء | تحرير الفيديو | مكونات الهاردوير | C++ | Python | Java

# arabic
source: Arabic — Native/Bilingual
ar: العربية — اللغة الأم/ثنائي اللغة

# english
source: English — Proficient
ar: الإنجليزية — متقدم

# projectsEttaminUi
source: Ettamin UI
ar: واجهة إتمامين UI

# projectsEttamin
source: Ettamin
ar: إتمامين

# projectsEttaminDesc
source: This application provides an easy user interface for patients to record medical conditions and all their history to show them to doctors any time.
ar: يوفر هذا التطبيق واجهة سهلة للمرضى لتسجيل الحالات الطبية وكامل تاريخهم لعرضها على الأطباء في أي وقت.

# projectsCastyUi
source: Casty UI
ar: واجهة كاستي UI

# projectsCastyUiDesc
source: Modern and easy UI
ar: واجهة حديثة وسهلة

# projectsCasty
source: Casty
ar: كاستي

# projectsCastyDesc
source: The platform provides a valuable resource for media production companies, granting them convenient access to a comprehensive pool of talented individuals eager to showcase their abilities.
ar: توفر المنصة مورداً قيماً لشركات الإنتاج الإعلامي، وتمنحهم وصولاً سهلاً إلى مجموعة شاملة من المواهب الراغبة في عرض قدراتها.

# projectsOrchida
source: Orchida clinic
ar: عيادة أورشيدا

# projectsOrchidaDesc
source: This app simplifies scheduling and patient care. Doctors can easily create new reservations and update patient medical histories. The app ensures efficient clinic operations with a focus on user-friendly design and strong customer support, enhancing both doctor and patient experiences.
ar: يبسط هذا التطبيق جدولة المواعيد ورعاية المرضى. يمكن للأطباء إنشاء حجوزات جديدة وتحديث السجلات الطبية بسهولة. يضمن التطبيق عمليات عيادة فعالة مع تصميم سهل الاستخدام ودعم قوي للعملاء، مما يعزز تجربة الطبيب والمريض.

# projectsPinionDesc
source: Pinion CRM is a user-friendly customer relationship management application designed to streamline business operations by providing easy access to customer management, financial transactions, inventory tracking, and invoicing data. With a modern interface and intuitive navigation, it helps businesses efficiently manage customers, sales, stock, and locations.
ar: Pinion CRM هو تطبيق إدارة علاقات العملاء سهل الاستخدام مصمم لتبسيط العمليات التجارية من خلال توفير وصول سهل لإدارة العملاء والمعاملات المالية وتتبع المخزون والفواتير. بواجهة حديثة وتنقل بديهي، يساعد الشركات على إدارة العملاء والمبيعات والمخزون والمواقع بكفاءة.

# projectsPerfect
source: Perfect Solution
ar: الحل المثالي

# projectsPerfectDesc
source: A powerful Flutter-based mobile integrated with Odoo ERP via Odoo RPC, featuring secure authentication, real-time data sync, CRUD operations, Optimized with flutter_bloc for performance.
ar: تطبيق Flutter قوي متكامل مع Odoo ERP عبر Odoo RPC، يتميز بالمصادقة الآمنة، ومزامنة البيانات في الوقت الفعلي، وعمليات CRUD، ومحسن باستخدام flutter_bloc للأداء.
